Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: فاتخذتموهم سخريا حتى أنسوكم ذكري وكنتم منهم تضحكون
en: But you took them for a laughing stock, so much so that they made you forget My Remembrance while you used to laugh at them!

source: إني جزيتهم اليوم بما صبروا أنهم هم الفائزون
en: Verily I have rewarded them this Day for their patience: they are indeed the ones that are successful.

source: قال كم لبثتم في الأرض عدد سنين
en: He (Allah) will say: "What number of years did you stay on earth?"

source: قالوا لبثنا يوما أو بعض يوم فاسأل العادين
en: They will say: "We stayed a day or part of a day. Ask of those who keep account."

source: قال إن لبثتم إلا قليلا لو أنكم كنتم تعلمون
en: He (Allah) will say: "You stayed not but a little, if you had only known!

source: أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون
en: "Did you think that We had created you in play (without any purpose), and that you would not be brought back to Us?"

source: فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم
en: So Exalted be Allah, the True King: La ilaha illa Huwa (none has the right to be worshipped but He), the Lord of the Supreme Throne!

source: ومن يدع مع الله إلها آخر لا برهان له به فإنما حسابه عند ربه إنه لا يفلح الكافرون
en: And whoever invokes (or worships), besides Allah, any other ilah (god), of whom he has no proof; then his reckoning is only with his Lord. Surely! Al-Kafirun (the disbelievers in Allah and in the Oneness of Allah, polytheists, pagans, idolaters) will not be successful.

source: وقل رب اغفر وارحم وأنت خير الراحمين
en: And say (O Muhammad صلى الله عليه وسلم): "My Lord! Forgive and have mercy, for You are the Best of those who show mercy!"

source: سورة أنزلناها وفرضناها وأنزلنا فيها آيات بينات لعلكم تذكرون
en: (This is) a Surah (chapter of the Qur'an) which We have sent down and which We have enjoined, (ordained its laws); and in it We have revealed manifest Ayat (proofs, evidence, verses, lessons, signs, revelations - lawful and unlawful things, and set boundaries of Islamic Religion), that you may remember.

source: الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة ولا تأخذكم بهما رأفة في دين الله إن كنتم تؤمنون بالله واليوم الآخر وليشهد عذابهما طائفة من المؤمنين
en: The fornicatress and the fornicator, flog each of them with a hundred stripes. Let not pity withhold you in their case, in a punishment prescribed by Allah, if you believe in Allah and the Last Day. And let a party of the believers witness their punishment. (This punishment is for unmarried persons guilty of the above crime, but if married persons commit it (illegal sex), the punishment is to stone them to death, according to Allah's Law).

source: الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين
en: The adulterer-fornicator marries not but an adulteress-fornicatress or a Mushrikah, and the adulteress-fornicatress none marries her except an adulterer-fornicator or a Muskrik [and that means that the man who agrees to marry (have a sexual relation with) a Mushrikah (female polytheist, pagan or idolatress) or a prostitute, then surely he is either an adulterer-fornicator, or a Mushrik (polytheist, pagan or idolater). And the woman who agrees to marry (have a sexual relation with) a Mushrik (polytheist, pagan or idolater) or an adulterer-fornicator, then she is either a prostitute or a Mushrikah (female polytheist, pagan, or idolatress)]. Such a thing is forbidden to the believers (of Islamic Monotheism).

source: والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة ولا تقبلوا لهم شهادة أبدا وأولئك هم الفاسقون
en: And those who accuse chaste women, and produce not four witnesses, flog them with eighty stripes, and reject their testimony forever. They indeed are the Fasiqun (liars, rebellious, disobedient to Allah).

source: والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم فشهادة أحدهم أربع شهادات بالله إنه لمن الصادقين
en: And for those who accuse their wives, but have no witnesses except themselves, let the testimony of one of them be four testimonies (i.e. testifies four times) by Allah that he is one of those who speak the truth.

source: والخامسة أن لعنت الله عليه إن كان من الكاذبين
en: And the fifth (testimony should be) the invoking of the Curse of Allah on him if he be of those who tell a lie (against her).

source: ويدرأ عنها العذاب أن تشهد أربع شهادات بالله إنه لمن الكاذبين
en: But it shall avert the punishment (of stoning to death) from her, if she bears witness four times by Allah, that he (her husband) is telling a lie.

source: والخامسة أن غضب الله عليها إن كان من الصادقين
en: And the fifth (testimony) should be that the Wrath of Allah be upon her if he (her husband) speaks the truth.

source: ولولا فضل الله عليكم ورحمته وأن الله تواب حكيم
en: And had it not been for the Grace of Allah and His Mercy on you (He would have hastened the punishment upon you)! And that Allah is the One Who forgives and accepts repentance, the All-Wise.

source: إن الذين جاءوا بالإفك عصبة منكم لا تحسبوه شرا لكم بل هو خير لكم لكل امرئ منهم ما اكتسب من الإثم والذي تولى كبره منهم له عذاب عظيم
en: Verily those who brought forth the slander (against 'Aishah رضي الله عنها the wife of the Prophet صلى الله عليه وسلم) are a group among you. Consider it not a bad thing for you. Nay, it is good for you. Unto every man among them will be paid that which he had earned of the sin, and as for him among them who had the greater share therein, his will be a great torment.

source: لولا إذ سمعتموه ظن المؤمنون والمؤمنات بأنفسهم خيرا وقالوا هذا إفك مبين
en: Why then, did not the believers, men and women, when you heard it (the slander), think good of their own people and say: "This (charge) is an obvious lie ?"

source: لولا جاءوا عليه بأربعة شهداء فإذ لم يأتوا بالشهداء فأولئك عند الله هم الكاذبون
en: Why did they not produce four witnesses? Since they (the slanderers) have not produced witnesses! Then with Allah they are the liars.

source: ولولا فضل الله عليكم ورحمته في الدنيا والآخرة لمسكم في ما أفضتم فيه عذاب عظيم
en: Had it not been for the Grace of Allah and His Mercy unto you in this world and in the Hereafter, a great torment would have touched you for that whereof you had spoken.

source: إذ تلقونه بألسنتكم وتقولون بأفواهكم ما ليس لكم به علم وتحسبونه هينا وهو عند الله عظيم
en: When you were propagating it with your tongues, and uttering with your mouths that whereof you had no knowledge, you counted it a little thing, while with Allah it was very great.

source: ولولا إذ سمعتموه قلتم ما يكون لنا أن نتكلم بهذا سبحانك هذا بهتان عظيم
en: And why did you not, when you heard it, say: "It is not right for us to speak of this. Glory be to You (O Allah)! This is a great lie."

source: يعظكم الله أن تعودوا لمثله أبدا إن كنتم مؤمنين
en: Allah forbids you from it and warns you not to repeat the like of it forever, if you are believers.

source: ويبين الله لكم الآيات والله عليم حكيم
en: And Allah makes the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) plain to you, and Allah is All-Knowing, All-Wise.

source: إن الذين يحبون أن تشيع الفاحشة في الذين آمنوا لهم عذاب أليم في الدنيا والآخرة والله يعلم وأنتم لا تعلمون
en: Verily, those who like that (the crime of) illegal sexual intercourse should be propagated among those who believe, they will have a painful torment in this world and in the Hereafter. And Allah knows and you know not.

source: ولولا فضل الله عليكم ورحمته وأن الله رءوف رحيم
en: And had it not been for the Grace of Allah and His Mercy on you, (Allah would have hastened the punishment upon you). And that Allah is full of Kindness, Most Merciful.

source: يا أيها الذين آمنوا لا تتبعوا خطوات الشيطان ومن يتبع خطوات الشيطان فإنه يأمر بالفحشاء والمنكر ولولا فضل الله عليكم ورحمته ما زكى منكم من أحد أبدا ولكن الله يزكي من يشاء والله سميع عليم
en: O you who believe! Follow not the footsteps of Shaitan (Satan). And whosoever follows the footsteps of Shaitan (Satan), then, verily he commands Al-Fahsha' [i.e. to commit indecency (illegal sexual intercourse)], and Al-Munkar [disbelief and polytheism (i.e. to do evil and wicked deeds; and to speak or to do what is forbidden in Islam)]. And had it not been for the Grace of Allah and His Mercy on you, not one of you would ever have been pure from sins. But Allah purifies (guides to Islam) whom He wills, and Allah is All-Hearer, All-Knower.

source: ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى والمساكين والمهاجرين في سبيل الله وليعفوا وليصفحوا ألا تحبون أن يغفر الله لكم والله غفور رحيم
en: And let not those among you who are blessed with graces and wealth swear not to give (any sort of help) to their kinsmen, Al-Masakin (the poor), and those who left their homes for Allah's Cause. Let them pardon and forgive. Do you not love that Allah should forgive you? And Allah is Oft-Forgiving, Most Merciful.

source: إن الذين يرمون المحصنات الغافلات المؤمنات لعنوا في الدنيا والآخرة ولهم عذاب عظيم
en: Verily, those who accuse chaste women, who never even think of anything touching their chastity and are good believers - are cursed in this life and in the Hereafter, and for them will be a great torment -

source: يوم تشهد عليهم ألسنتهم وأيديهم وأرجلهم بما كانوا يعملون
en: On the Day when their tongues, their hands, and their legs (or feet) will bear witness against them as to what they used to do.

source: يومئذ يوفيهم الله دينهم الحق ويعلمون أن الله هو الحق المبين
en: On that Day Allah will pay them the recompense of their deeds in full, and they will know that Allah, He is the Manifest Truth.

source: الخبيثات للخبيثين والخبيثون للخبيثات والطيبات للطيبين والطيبون للطيبات أولئك مبرءون مما يقولون لهم مغفرة ورزق كريم
en: Bad statements are for bad people (or bad women for bad men) and bad people for bad statements (or bad men for bad women). Good statements are for good people (or good women for good men) and good people for good statements (or good men for good women): such (good people) are innocent of (every) bad statement which they say; for them is Forgiveness, and Rizqun Karim (generous provision i.e. Paradise).

source: يا أيها الذين آمنوا لا تدخلوا بيوتا غير بيوتكم حتى تستأنسوا وتسلموا على أهلها ذلكم خير لكم لعلكم تذكرون
en: O you who believe! Enter not houses other than your own, until you have asked permission and greeted those in them; that is better for you, in order that you may remember.

source: فإن لم تجدوا فيها أحدا فلا تدخلوها حتى يؤذن لكم وإن قيل لكم ارجعوا فارجعوا هو أزكى لكم والله بما تعملون عليم
en: And if you find no one therein, still, enter not until permission has been given. And if you are asked to go back, go back, for it is purer for you. And Allah is All-Knower of what you do.

source: ليس عليكم جناح أن تدخلوا بيوتا غير مسكونة فيها متاع لكم والله يعلم ما تبدون وما تكتمون
en: There is no sin on you that you enter (without taking permission) houses uninhabited (i.e. not possessed by anybody), (when) you have any interest in them. And Allah has knowledge of what you reveal and what you conceal.

source: قل للمؤمنين يغضوا من أبصارهم ويحفظوا فروجهم ذلك أزكى لهم إن الله خبير بما يصنعون
en: Tell the believing men to lower their gaze (from looking at forbidden things), and protect their private parts (from illegal sexual acts). That is purer for them. Verily, Allah is All-Aware of what they do.

source: وقل للمؤمنات يغضضن من أبصارهن ويحفظن فروجهن ولا يبدين زينتهن إلا ما ظهر منها وليضربن بخمرهن على جيوبهن ولا يبدين زينتهن إلا لبعولتهن أو آبائهن أو آباء بعولتهن أو أبنائهن أو أبناء بعولتهن أو إخوانهن أو بني إخوانهن أو بني أخواتهن أو نسائهن أو ما ملكت أيمانهن أو التابعين غير أولي الإربة من الرجال أو الطفل الذين لم يظهروا على عورات النساء ولا يضربن بأرجلهن ليعلم ما يخفين من زينتهن وتوبوا إلى الله جميعا أيه المؤمنون لعلكم تفلحون
en: And tell the believing women to lower their gaze (from looking at forbidden things), and protect their private parts (from illegal sexual acts) and not to show off their adornment except only that which is apparent (like both eyes for necessity to see the way, or outer palms of hands or one eye or dress like veil, gloves, head-cover, apron, etc.), and to draw their veils all over Juyubihinna (i.e. their bodies, faces, necks and bosoms) and not to reveal their adornment except to their husbands, or their fathers, or their husband's fathers, or their sons, or their husband's sons, or their brothers or their brother's sons, or their sister's sons, or their (Muslim) women (i.e. their sisters in Islam), or the (female) slaves whom their right hands possess, or old male servants who lack vigour, or small children who have no sense of feminine sex. And let them not stamp their feet so as to reveal what they hide of their adornment. And all of you beg Allah to forgive you all, O believers, that you may be successful.

source: وأنكحوا الأيامى منكم والصالحين من عبادكم وإمائكم إن يكونوا فقراء يغنهم الله من فضله والله واسع عليم
en: And marry those among you who are single (i.e. a man who has no wife and the woman who has no husband) and (also marry) the Salihun (pious, fit and capable ones) of your (male) slaves and maid-servants (female slaves). If they be poor, Allah will enrich them out of His Bounty. And Allah is All-Sufficient for His creatures' needs, All-Knowing (about the state of the people).

source: وليستعفف الذين لا يجدون نكاحا حتى يغنيهم الله من فضله والذين يبتغون الكتاب مما ملكت أيمانكم فكاتبوهم إن علمتم فيهم خيرا وآتوهم من مال الله الذي آتاكم ولا تكرهوا فتياتكم على البغاء إن أردن تحصنا لتبتغوا عرض الحياة الدنيا ومن يكرههن فإن الله من بعد إكراههن غفور رحيم
en: And let those who find not the financial means for marriage keep themselves chaste, until Allah enriches them of His Bounty. And such of your slaves as seek a writing (of emancipation), give them such writing, if you find that there is good and honesty in them. And give them something (yourselves) out of the wealth of Allah which He has bestowed upon you. And force not your maids to prostitution, if they desire chastity, in order that you may make a gain in the (perishable) goods of this worldly life. But if anyone compels them (to prostitution), then after such compulsion, Allah is Oft-Forgiving, Most Merciful (to those women, i.e. He will forgive them because they have been forced to do this evil act unwillingly).

source: ولقد أنزلنا إليكم آيات مبينات ومثلا من الذين خلوا من قبلكم وموعظة للمتقين
en: And indeed We have sent down for you Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) that make things plain, and the example of those who passed away before you, and an admonition for those who are Al-Muttaqun (the pious - See V.2:2).

source: الله نور السماوات والأرض مثل نوره كمشكاة فيها مصباح المصباح في زجاجة الزجاجة كأنها كوكب دري يوقد من شجرة مباركة زيتونة لا شرقية ولا غربية يكاد زيتها يضيء ولو لم تمسسه نار نور على نور يهدي الله لنوره من يشاء ويضرب الله الأمثال للناس والله بكل شيء عليم
en: Allah is the Light of the heavens and the earth. The parable of His Light is as (if there were) a niche and within it a lamp: the lamp is in a glass, the glass as it were a brilliant star, lit from a blessed tree, an olive, neither of the east (i.e. neither it gets sun-rays only in the morning) nor of the west (i.e. nor it gets sun-rays only in the afternoon, but it is exposed to the sun all day long), whose oil would almost glow forth (of itself), though no fire touched it. Light upon Light! Allah guides to His Light whom He wills. And Allah sets forth parables for mankind, and Allah is All-Knower of everything.

source: في بيوت أذن الله أن ترفع ويذكر فيها اسمه يسبح له فيها بالغدو والآصال
en: In houses (mosques) which Allah has ordered to be raised (to be cleaned, and to be honoured), in them His Name is remembered [i.e. Adhan, Iqamah, Salat (prayers), invocations, recitation of the Qur'an etc.]. Therein glorify Him (Allah) in the mornings and in the afternoons or the evenings,

source: رجال لا تلهيهم تجارة ولا بيع عن ذكر الله وإقام الصلاة وإيتاء الزكاة يخافون يوما تتقلب فيه القلوب والأبصار
en: Men whom neither trade nor sale (business) diverts from the Remembrance of Allah (with heart and tongue), nor from performing As-Salat (Iqamat-as-Salat), nor from giving the Zakat. They fear a Day when hearts and eyes will be overturned (out of the horror of the torment of the Day of Resurrection).

source: ليجزيهم الله أحسن ما عملوا ويزيدهم من فضله والله يرزق من يشاء بغير حساب
en: That Allah may reward them according to the best of their deeds, and add even more for them out of His Grace. And Allah provides without measure to whom He wills.

source: والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء حتى إذا جاءه لم يجده شيئا ووجد الله عنده فوفاه حسابه والله سريع الحساب
en: As for those who disbelieve, their deeds are like a mirage in a desert. The thirsty one thinks it to be water, until he comes up to it, he finds it to be nothing; but he finds Allah with him, Who will pay him his due (Hell). And Allah is Swift in taking account.

source: أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ظلمات بعضها فوق بعض إذا أخرج يده لم يكد يراها ومن لم يجعل الله له نورا فما له من نور
en: Or [the state of a disbeliever] is like the darkness in a vast deep sea, overwhelmed with waves topped by waves, topped by dark clouds, (layers of) darkness upon darkness: if a man stretches out his hand, he can hardly see it! And he for whom Allah has not appointed light, for him there is no light.

source: ألم تر أن الله يسبح له من في السماوات والأرض والطير صافات كل قد علم صلاته وتسبيحه والله عليم بما يفعلون
en: See you not (O Muhammad صلى الله عليه وسلم) that Allah, He it is Whom glorify whosoever is in the heavens and the earth, and the birds with wings out-spread (in their flight)?. Of each one He (Allah) knows indeed his Salat (prayer) and his glorification, [or everyone knows his Salat (prayer) and his glorification]; and Allah is All-Aware of what they do.

source: ولله ملك السماوات والأرض وإلى الله المصير
en: And to Allah belongs the sovereignty of the heavens and the earth, and to Allah is the return (of all).

source: ألم تر أن الله يزجي سحابا ثم يؤلف بينه ثم يجعله ركاما فترى الودق يخرج من خلاله وينزل من السماء من جبال فيها من برد فيصيب به من يشاء ويصرفه عن من يشاء يكاد سنا برقه يذهب بالأبصار
en: See you not that Allah drives the clouds gently, then joins them together, then makes them into a heap of layers, and you see the rain comes forth from between them; and He sends down from the sky hail (like) mountains, (or there are in the heaven mountains of hail from where He sends down hail), and strikes therewith whom He wills, and averts it from whom He wills. The vivid flash of its (clouds) lightning nearly blinds the sight. [Tafsir At-Tabari].

source: يقلب الله الليل والنهار إن في ذلك لعبرة لأولي الأبصار
en: Allah causes the night and the day to succeed each other (i.e. if the day is gone, the night comes, and if the night is gone, the day comes, and so on). Truly, in this is indeed a lesson for those who have insight.

source: والله خلق كل دابة من ماء فمنهم من يمشي على بطنه ومنهم من يمشي على رجلين ومنهم من يمشي على أربع يخلق الله ما يشاء إن الله على كل شيء قدير
en: Allah has created every moving (living) creature from water. Of them there are some that creep on their bellies, and some that walk on two legs, and some that walk on four. Allah creates what He wills. Verily Allah is Able to do all things.

source: لقد أنزلنا آيات مبينات والله يهدي من يشاء إلى صراط مستقيم
en: We have indeed sent down (in this Qur'an) manifest Ayat (proofs, evidence, verses, lessons, signs, revelations, lawful and unlawful things, and the set boundaries of Islamic religion, etc. that make things clear showing the Right Path of Allah). And Allah guides whom He wills to the Straight Path (i.e. to Allah's religion of Islamic Monotheism).

source: ويقولون آمنا بالله وبالرسول وأطعنا ثم يتولى فريق منهم من بعد ذلك وما أولئك بالمؤمنين
en: They (hypocrites) say: "We have believed in Allah and in the Messenger (Muhammad صلى الله عليه وسلم), and we obey," then a party of them turn away thereafter, such are not believers.

source: وإذا دعوا إلى الله ورسوله ليحكم بينهم إذا فريق منهم معرضون
en: And when they are called to Allah (i.e. His Words, the Qur'an) and His Messenger (صلى الله عليه وسلم), to judge between them, lo! a party of them refuses (to come) and turns away.

source: وإن يكن لهم الحق يأتوا إليه مذعنين
en: But if the truth is on their side, they come to him willingly with submission.

source: أفي قلوبهم مرض أم ارتابوا أم يخافون أن يحيف الله عليهم ورسوله بل أولئك هم الظالمون
en: Is there a disease in their hearts? Or do they doubt or fear lest Allah and His Messenger (صلى الله عليه وسلم) should wrong them in judgement. Nay, it is they themselves who are the Zalimun (polytheists, hypocrites and wrong-doers).

source: إنما كان قول المؤمنين إذا دعوا إلى الله ورسوله ليحكم بينهم أن يقولوا سمعنا وأطعنا وأولئك هم المفلحون
en: The only saying of the faithful believers, when they are called to Allah (His Words, the Qur'an) and His Messenger (صلى الله عليه وسلم), to judge between them, is that they say: "We hear and we obey." And such are the successful (who will live forever in Paradise).

source: ومن يطع الله ورسوله ويخش الله ويتقه فأولئك هم الفائزون
en: And whosoever obeys Allah and His Messenger (صلى الله عليه وسلم), fears Allah, and keeps his duty (to Him), such are the successful.

source: وأقسموا بالله جهد أيمانهم لئن أمرتهم ليخرجن قل لا تقسموا طاعة معروفة إن الله خبير بما تعملون
en: They swear by Allah their strongest oaths, that if only you would order them, they would leave (their homes for fighting in Allah's Cause). Say: "Swear you not; (this) obedience (of yours) is known (to be false). Verily, Allah knows well what you do."

source: قل أطيعوا الله وأطيعوا الرسول فإن تولوا فإنما عليه ما حمل وعليكم ما حملتم وإن تطيعوه تهتدوا وما على الرسول إلا البلاغ المبين
en: Say: "Obey Allah and obey the Messenger, but if you turn away, he (Messenger Muhammad صلى الله عليه وسلم) is only responsible for the duty placed on him (i.e. to convey Allah's Message) and you for that placed on you. If you obey him, you shall be on the right guidance. The Messenger's duty is only to convey (the message) in a clear way (i.e. to preach in a plain way)."

source: وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذي ارتضى لهم وليبدلنهم من بعد خوفهم أمنا يعبدونني لا يشركون بي شيئا ومن كفر بعد ذلك فأولئك هم الفاسقون
en: Allah has promised those among you who believe and do righteous good deeds, that He will certainly grant them succession to (the present rulers) in the land, as He granted it to those before them, and that He will grant them the authority to practise their religion which He has chosen for them (i.e. Islam). And He will surely give them in exchange a safe security after their fear (provided) they (believers) worship Me and do not associate anything (in worship) with Me. But whoever disbelieves after this, they are the Fasiqun (rebellious, disobedient to Allah).

source: وأقيموا الصلاة وآتوا الزكاة وأطيعوا الرسول لعلكم ترحمون
en: And perform As-Salat (Iqamat-as-Salat), and give Zakat and obey the Messenger (Muhammad صلى الله عليه وسلم) that you may receive mercy (from Allah).

source: لا تحسبن الذين كفروا معجزين في الأرض ومأواهم النار ولبئس المصير
en: Consider not that the disbelievers can escape in the land. Their abode shall be the Fire - and worst indeed is that destination.
